results/stress-test/db-only-100-500vu.txt
Stress Test를 시작합니다.
시스템 부하가 지나치게 높으면 Ctrl+C로 중단하세요.

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /scripts/redirect-stress.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 4m50s max duration (incl. graceful stop):
              * default: Up to 500 looping VUs for 4m20s over 9 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m00.9s), 004/500 VUs, 385 complete and 0 interrupted iterations
default   [   0% ] 004/500 VUs  0m00.7s/4m20.0s

running (0m01.9s), 009/500 VUs, 1583 complete and 0 interrupted iterations
default   [   1% ] 009/500 VUs  0m01.7s/4m20.0s

running (0m02.9s), 014/500 VUs, 2629 complete and 0 interrupted iterations
default   [   1% ] 014/500 VUs  0m02.7s/4m20.0s

running (0m03.9s), 019/500 VUs, 4877 complete and 0 interrupted iterations
default   [   1% ] 019/500 VUs  0m03.7s/4m20.0s

running (0m04.9s), 024/500 VUs, 6929 complete and 0 interrupted iterations
default   [   2% ] 024/500 VUs  0m04.7s/4m20.0s

running (0m05.9s), 029/500 VUs, 9393 complete and 0 interrupted iterations
default   [   2% ] 029/500 VUs  0m05.7s/4m20.0s

running (0m06.9s), 034/500 VUs, 12820 complete and 0 interrupted iterations
default   [   3% ] 034/500 VUs  0m06.7s/4m20.0s

running (0m07.9s), 039/500 VUs, 16163 complete and 0 interrupted iterations
default   [   3% ] 039/500 VUs  0m07.7s/4m20.0s

running (0m08.9s), 044/500 VUs, 18930 complete and 0 interrupted iterations
default   [   3% ] 044/500 VUs  0m08.7s/4m20.0s

running (0m09.9s), 049/500 VUs, 20827 complete and 0 interrupted iterations
default   [   4% ] 049/500 VUs  0m09.7s/4m20.0s

running (0m10.9s), 054/500 VUs, 23300 complete and 0 interrupted iterations
default   [   4% ] 054/500 VUs  0m10.7s/4m20.0s

running (0m11.9s), 059/500 VUs, 26269 complete and 0 interrupted iterations
default   [   5% ] 059/500 VUs  0m11.7s/4m20.0s

running (0m12.9s), 063/500 VUs, 29929 complete and 0 interrupted iterations
default   [   5% ] 063/500 VUs  0m12.7s/4m20.0s

running (0m13.9s), 068/500 VUs, 32166 complete and 0 interrupted iterations
default   [   5% ] 068/500 VUs  0m13.7s/4m20.0s

running (0m14.9s), 073/500 VUs, 35235 complete and 0 interrupted iterations
default   [   6% ] 073/500 VUs  0m14.7s/4m20.0s

running (0m15.9s), 078/500 VUs, 38608 complete and 0 interrupted iterations
default   [   6% ] 078/500 VUs  0m15.7s/4m20.0s

running (0m16.9s), 083/500 VUs, 44019 complete and 0 interrupted iterations
default   [   6% ] 083/500 VUs  0m16.7s/4m20.0s

running (0m17.9s), 088/500 VUs, 50728 complete and 0 interrupted iterations
default   [   7% ] 088/500 VUs  0m17.7s/4m20.0s

running (0m18.9s), 093/500 VUs, 58287 complete and 0 interrupted iterations
default   [   7% ] 093/500 VUs  0m18.7s/4m20.0s

running (0m19.9s), 098/500 VUs, 65576 complete and 0 interrupted iterations
default   [   8% ] 098/500 VUs  0m19.7s/4m20.0s

running (0m20.9s), 100/500 VUs, 71751 complete and 0 interrupted iterations
default   [   8% ] 100/500 VUs  0m20.7s/4m20.0s

running (0m21.9s), 100/500 VUs, 79030 complete and 0 interrupted iterations
default   [   8% ] 100/500 VUs  0m21.7s/4m20.0s

running (0m22.9s), 100/500 VUs, 86451 complete and 0 interrupted iterations
default   [   9% ] 100/500 VUs  0m22.7s/4m20.0s

running (0m23.9s), 100/500 VUs, 93805 complete and 0 interrupted iterations
default   [   9% ] 100/500 VUs  0m23.7s/4m20.0s

running (0m24.9s), 100/500 VUs, 100031 complete and 0 interrupted iterations
default   [  10% ] 100/500 VUs  0m24.7s/4m20.0s

running (0m25.9s), 100/500 VUs, 105158 complete and 0 interrupted iterations
default   [  10% ] 100/500 VUs  0m25.7s/4m20.0s

running (0m26.9s), 100/500 VUs, 110668 complete and 0 interrupted iterations
default   [  10% ] 100/500 VUs  0m26.7s/4m20.0s

running (0m27.9s), 100/500 VUs, 115480 complete and 0 interrupted iterations
default   [  11% ] 100/500 VUs  0m27.7s/4m20.0s

running (0m28.9s), 100/500 VUs, 121880 complete and 0 interrupted iterations
default   [  11% ] 100/500 VUs  0m28.7s/4m20.0s

running (0m29.9s), 100/500 VUs, 126642 complete and 0 interrupted iterations
default   [  11% ] 100/500 VUs  0m29.7s/4m20.0s

running (0m30.9s), 100/500 VUs, 132796 complete and 0 interrupted iterations
default   [  12% ] 100/500 VUs  0m30.7s/4m20.0s

running (0m31.9s), 100/500 VUs, 139309 complete and 0 interrupted iterations
default   [  12% ] 100/500 VUs  0m31.7s/4m20.0s

running (0m32.9s), 100/500 VUs, 146156 complete and 0 interrupted iterations
default   [  13% ] 100/500 VUs  0m32.7s/4m20.0s

running (0m33.9s), 100/500 VUs, 150747 complete and 0 interrupted iterations
default   [  13% ] 100/500 VUs  0m33.7s/4m20.0s

running (0m34.9s), 100/500 VUs, 157237 complete and 0 interrupted iterations
default   [  13% ] 100/500 VUs  0m34.7s/4m20.0s

running (0m35.9s), 100/500 VUs, 163315 complete and 0 interrupted iterations
default   [  14% ] 100/500 VUs  0m35.7s/4m20.0s

running (0m36.9s), 100/500 VUs, 170035 complete and 0 interrupted iterations
default   [  14% ] 100/500 VUs  0m36.7s/4m20.0s

running (0m37.9s), 100/500 VUs, 173957 complete and 0 interrupted iterations
default   [  15% ] 100/500 VUs  0m37.7s/4m20.0s

running (0m38.9s), 100/500 VUs, 181263 complete and 0 interrupted iterations
default   [  15% ] 100/500 VUs  0m38.7s/4m20.0s

running (0m39.9s), 100/500 VUs, 189533 complete and 0 interrupted iterations
default   [  15% ] 100/500 VUs  0m39.7s/4m20.0s

running (0m40.9s), 100/500 VUs, 196933 complete and 0 interrupted iterations
default   [  16% ] 100/500 VUs  0m40.7s/4m20.0s

running (0m41.9s), 100/500 VUs, 206162 complete and 0 interrupted iterations
default   [  16% ] 100/500 VUs  0m41.7s/4m20.0s

running (0m42.9s), 100/500 VUs, 215070 complete and 0 interrupted iterations
default   [  16% ] 100/500 VUs  0m42.7s/4m20.0s

running (0m43.9s), 100/500 VUs, 223730 complete and 0 interrupted iterations
default   [  17% ] 100/500 VUs  0m43.7s/4m20.0s

running (0m44.9s), 100/500 VUs, 232600 complete and 0 interrupted iterations
default   [  17% ] 100/500 VUs  0m44.7s/4m20.0s

running (0m45.9s), 100/500 VUs, 240348 complete and 0 interrupted iterations
default   [  18% ] 100/500 VUs  0m45.7s/4m20.0s

running (0m46.9s), 100/500 VUs, 249140 complete and 0 interrupted iterations
default   [  18% ] 100/500 VUs  0m46.7s/4m20.0s

running (0m47.9s), 100/500 VUs, 257122 complete and 0 interrupted iterations
default   [  18% ] 100/500 VUs  0m47.7s/4m20.0s

running (0m48.9s), 100/500 VUs, 265518 complete and 0 interrupted iterations
default   [  19% ] 100/500 VUs  0m48.7s/4m20.0s

running (0m49.9s), 100/500 VUs, 274862 complete and 0 interrupted iterations
default   [  19% ] 100/500 VUs  0m49.7s/4m20.0s

running (0m50.9s), 100/500 VUs, 283042 complete and 0 interrupted iterations
default   [  20% ] 100/500 VUs  0m50.7s/4m20.0s

running (0m51.9s), 100/500 VUs, 292359 complete and 0 interrupted iterations
default   [  20% ] 100/500 VUs  0m51.7s/4m20.0s

running (0m52.9s), 100/500 VUs, 301466 complete and 0 interrupted iterations
default   [  20% ] 100/500 VUs  0m52.7s/4m20.0s

running (0m53.9s), 100/500 VUs, 309166 complete and 0 interrupted iterations
default   [  21% ] 100/500 VUs  0m53.7s/4m20.0s

running (0m54.9s), 100/500 VUs, 318234 complete and 0 interrupted iterations
default   [  21% ] 100/500 VUs  0m54.7s/4m20.0s

running (0m55.9s), 100/500 VUs, 326380 complete and 0 interrupted iterations
default   [  21% ] 100/500 VUs  0m55.7s/4m20.0s

running (0m56.9s), 100/500 VUs, 334180 complete and 0 interrupted iterations
default   [  22% ] 100/500 VUs  0m56.7s/4m20.0s

running (0m57.9s), 100/500 VUs, 342676 complete and 0 interrupted iterations
default   [  22% ] 100/500 VUs  0m57.7s/4m20.0s

running (0m58.9s), 100/500 VUs, 351665 complete and 0 interrupted iterations
default   [  23% ] 100/500 VUs  0m58.7s/4m20.0s

running (0m59.9s), 100/500 VUs, 360810 complete and 0 interrupted iterations
default   [  23% ] 100/500 VUs  0m59.7s/4m20.0s

running (1m00.9s), 103/500 VUs, 369249 complete and 0 interrupted iterations
default   [  23% ] 103/500 VUs  1m00.7s/4m20.0s

running (1m01.9s), 108/500 VUs, 378403 complete and 0 interrupted iterations
default   [  24% ] 108/500 VUs  1m01.7s/4m20.0s

running (1m02.9s), 113/500 VUs, 387672 complete and 0 interrupted iterations
default   [  24% ] 113/500 VUs  1m02.7s/4m20.0s

running (1m03.9s), 118/500 VUs, 396902 complete and 0 interrupted iterations
default   [  25% ] 118/500 VUs  1m03.7s/4m20.0s

running (1m04.9s), 123/500 VUs, 406153 complete and 0 interrupted iterations
default   [  25% ] 123/500 VUs  1m04.7s/4m20.0s

running (1m05.9s), 128/500 VUs, 414197 complete and 0 interrupted iterations
default   [  25% ] 128/500 VUs  1m05.7s/4m20.0s

running (1m06.9s), 133/500 VUs, 422995 complete and 0 interrupted iterations
default   [  26% ] 133/500 VUs  1m06.7s/4m20.0s

running (1m07.9s), 138/500 VUs, 431859 complete and 0 interrupted iterations
default   [  26% ] 138/500 VUs  1m07.7s/4m20.0s

running (1m08.9s), 143/500 VUs, 440330 complete and 0 interrupted iterations
default   [  26% ] 143/500 VUs  1m08.7s/4m20.0s

running (1m09.9s), 148/500 VUs, 449654 complete and 0 interrupted iterations
default   [  27% ] 148/500 VUs  1m09.7s/4m20.0s

running (1m10.9s), 153/500 VUs, 458205 complete and 0 interrupted iterations
default   [  27% ] 153/500 VUs  1m10.7s/4m20.0s

running (1m11.9s), 158/500 VUs, 467622 complete and 0 interrupted iterations
default   [  28% ] 158/500 VUs  1m11.7s/4m20.0s

running (1m12.9s), 163/500 VUs, 476616 complete and 0 interrupted iterations
default   [  28% ] 163/500 VUs  1m12.7s/4m20.0s

running (1m13.9s), 168/500 VUs, 485513 complete and 0 interrupted iterations
default   [  28% ] 168/500 VUs  1m13.7s/4m20.0s

running (1m14.9s), 173/500 VUs, 494630 complete and 0 interrupted iterations
default   [  29% ] 173/500 VUs  1m14.7s/4m20.0s

running (1m15.9s), 178/500 VUs, 503312 complete and 0 interrupted iterations
default   [  29% ] 178/500 VUs  1m15.7s/4m20.0s

running (1m16.9s), 183/500 VUs, 512435 complete and 0 interrupted iterations
default   [  30% ] 183/500 VUs  1m16.7s/4m20.0s

running (1m17.9s), 188/500 VUs, 521377 complete and 0 interrupted iterations
default   [  30% ] 188/500 VUs  1m17.7s/4m20.0s

running (1m18.9s), 193/500 VUs, 530277 complete and 0 interrupted iterations
default   [  30% ] 193/500 VUs  1m18.7s/4m20.0s

running (1m19.9s), 198/500 VUs, 539288 complete and 0 interrupted iterations
default   [  31% ] 198/500 VUs  1m19.7s/4m20.0s

running (1m20.9s), 200/500 VUs, 547700 complete and 0 interrupted iterations
default   [  31% ] 200/500 VUs  1m20.7s/4m20.0s

running (1m21.9s), 200/500 VUs, 556706 complete and 0 interrupted iterations
default   [  31% ] 200/500 VUs  1m21.7s/4m20.0s

running (1m22.9s), 200/500 VUs, 565499 complete and 0 interrupted iterations
default   [  32% ] 200/500 VUs  1m22.7s/4m20.0s

running (1m23.9s), 200/500 VUs, 574248 complete and 0 interrupted iterations
default   [  32% ] 200/500 VUs  1m23.7s/4m20.0s

running (1m24.9s), 200/500 VUs, 583395 complete and 0 interrupted iterations
default   [  33% ] 200/500 VUs  1m24.7s/4m20.0s

running (1m25.9s), 200/500 VUs, 591639 complete and 0 interrupted iterations
default   [  33% ] 200/500 VUs  1m25.7s/4m20.0s

running (1m26.9s), 200/500 VUs, 600704 complete and 0 interrupted iterations
default   [  33% ] 200/500 VUs  1m26.7s/4m20.0s

running (1m27.9s), 200/500 VUs, 609662 complete and 0 interrupted iterations
default   [  34% ] 200/500 VUs  1m27.7s/4m20.0s

running (1m28.9s), 200/500 VUs, 618493 complete and 0 interrupted iterations
default   [  34% ] 200/500 VUs  1m28.7s/4m20.0s

running (1m29.9s), 200/500 VUs, 627493 complete and 0 interrupted iterations
default   [  35% ] 200/500 VUs  1m29.7s/4m20.0s

running (1m30.9s), 200/500 VUs, 635770 complete and 0 interrupted iterations
default   [  35% ] 200/500 VUs  1m30.7s/4m20.0s

running (1m31.9s), 200/500 VUs, 644676 complete and 0 interrupted iterations
default   [  35% ] 200/500 VUs  1m31.7s/4m20.0s

running (1m32.9s), 200/500 VUs, 653634 complete and 0 interrupted iterations
default   [  36% ] 200/500 VUs  1m32.7s/4m20.0s

running (1m33.9s), 200/500 VUs, 662169 complete and 0 interrupted iterations
default   [  36% ] 200/500 VUs  1m33.7s/4m20.0s

running (1m34.9s), 200/500 VUs, 671184 complete and 0 interrupted iterations
default   [  36% ] 200/500 VUs  1m34.7s/4m20.0s

running (1m35.9s), 200/500 VUs, 679217 complete and 0 interrupted iterations
default   [  37% ] 200/500 VUs  1m35.7s/4m20.0s

running (1m36.9s), 200/500 VUs, 688197 complete and 0 interrupted iterations
default   [  37% ] 200/500 VUs  1m36.7s/4m20.0s

running (1m37.9s), 200/500 VUs, 696944 complete and 0 interrupted iterations
default   [  38% ] 200/500 VUs  1m37.7s/4m20.0s

running (1m38.9s), 200/500 VUs, 705664 complete and 0 interrupted iterations
default   [  38% ] 200/500 VUs  1m38.7s/4m20.0s

running (1m39.9s), 200/500 VUs, 714606 complete and 0 interrupted iterations
default   [  38% ] 200/500 VUs  1m39.7s/4m20.0s

running (1m40.9s), 200/500 VUs, 722995 complete and 0 interrupted iterations
default   [  39% ] 200/500 VUs  1m40.7s/4m20.0s

running (1m41.9s), 200/500 VUs, 731870 complete and 0 interrupted iterations
default   [  39% ] 200/500 VUs  1m41.7s/4m20.0s

running (1m42.9s), 200/500 VUs, 740886 complete and 0 interrupted iterations
default   [  40% ] 200/500 VUs  1m42.7s/4m20.0s

running (1m43.9s), 200/500 VUs, 749368 complete and 0 interrupted iterations
default   [  40% ] 200/500 VUs  1m43.7s/4m20.0s

running (1m44.9s), 200/500 VUs, 758428 complete and 0 interrupted iterations
default   [  40% ] 200/500 VUs  1m44.7s/4m20.0s

running (1m45.9s), 200/500 VUs, 766808 complete and 0 interrupted iterations
default   [  41% ] 200/500 VUs  1m45.7s/4m20.0s

running (1m46.9s), 200/500 VUs, 775632 complete and 0 interrupted iterations
default   [  41% ] 200/500 VUs  1m46.7s/4m20.0s

running (1m47.9s), 200/500 VUs, 784600 complete and 0 interrupted iterations
default   [  41% ] 200/500 VUs  1m47.7s/4m20.0s

running (1m48.9s), 200/500 VUs, 793407 complete and 0 interrupted iterations
default   [  42% ] 200/500 VUs  1m48.7s/4m20.0s

running (1m49.9s), 200/500 VUs, 802467 complete and 0 interrupted iterations
default   [  42% ] 200/500 VUs  1m49.7s/4m20.0s

running (1m50.9s), 200/500 VUs, 810825 complete and 0 interrupted iterations
default   [  43% ] 200/500 VUs  1m50.7s/4m20.0s

running (1m51.9s), 200/500 VUs, 819878 complete and 0 interrupted iterations
default   [  43% ] 200/500 VUs  1m51.7s/4m20.0s

running (1m52.9s), 200/500 VUs, 828780 complete and 0 interrupted iterations
default   [  43% ] 200/500 VUs  1m52.7s/4m20.0s

running (1m53.9s), 200/500 VUs, 837533 complete and 0 interrupted iterations
default   [  44% ] 200/500 VUs  1m53.7s/4m20.0s

running (1m54.9s), 200/500 VUs, 846464 complete and 0 interrupted iterations
default   [  44% ] 200/500 VUs  1m54.7s/4m20.0s

running (1m55.9s), 200/500 VUs, 854147 complete and 0 interrupted iterations
default   [  45% ] 200/500 VUs  1m55.7s/4m20.0s

running (1m56.9s), 200/500 VUs, 862984 complete and 0 interrupted iterations
default   [  45% ] 200/500 VUs  1m56.7s/4m20.0s

running (1m57.9s), 200/500 VUs, 871965 complete and 0 interrupted iterations
default   [  45% ] 200/500 VUs  1m57.7s/4m20.0s

running (1m58.9s), 200/500 VUs, 880794 complete and 0 interrupted iterations
default   [  46% ] 200/500 VUs  1m58.7s/4m20.0s

running (1m59.9s), 200/500 VUs, 889278 complete and 0 interrupted iterations
default   [  46% ] 200/500 VUs  1m59.7s/4m20.0s

running (2m00.9s), 203/500 VUs, 897722 complete and 0 interrupted iterations
default   [  46% ] 203/500 VUs  2m00.7s/4m20.0s

running (2m01.9s), 208/500 VUs, 906771 complete and 0 interrupted iterations
default   [  47% ] 208/500 VUs  2m01.7s/4m20.0s

running (2m02.9s), 213/500 VUs, 916037 complete and 0 interrupted iterations
default   [  47% ] 213/500 VUs  2m02.7s/4m20.0s

running (2m03.9s), 218/500 VUs, 924867 complete and 0 interrupted iterations
default   [  48% ] 218/500 VUs  2m03.7s/4m20.0s

running (2m04.9s), 223/500 VUs, 933894 complete and 0 interrupted iterations
default   [  48% ] 223/500 VUs  2m04.7s/4m20.0s

running (2m05.9s), 228/500 VUs, 942706 complete and 0 interrupted iterations
default   [  48% ] 228/500 VUs  2m05.7s/4m20.0s

running (2m06.9s), 233/500 VUs, 951633 complete and 0 interrupted iterations
default   [  49% ] 233/500 VUs  2m06.7s/4m20.0s

running (2m07.9s), 238/500 VUs, 960635 complete and 0 interrupted iterations
default   [  49% ] 238/500 VUs  2m07.7s/4m20.0s

running (2m08.9s), 243/500 VUs, 969170 complete and 0 interrupted iterations
default   [  50% ] 243/500 VUs  2m08.7s/4m20.0s

running (2m09.9s), 248/500 VUs, 978084 complete and 0 interrupted iterations
default   [  50% ] 248/500 VUs  2m09.7s/4m20.0s

running (2m10.9s), 253/500 VUs, 985927 complete and 0 interrupted iterations
default   [  50% ] 253/500 VUs  2m10.7s/4m20.0s

running (2m11.9s), 258/500 VUs, 994680 complete and 0 interrupted iterations
default   [  51% ] 258/500 VUs  2m11.7s/4m20.0s

running (2m12.9s), 263/500 VUs, 1003378 complete and 0 interrupted iterations
default   [  51% ] 263/500 VUs  2m12.7s/4m20.0s

running (2m13.9s), 268/500 VUs, 1011605 complete and 0 interrupted iterations
default   [  51% ] 268/500 VUs  2m13.7s/4m20.0s

running (2m14.9s), 273/500 VUs, 1020824 complete and 0 interrupted iterations
default   [  52% ] 273/500 VUs  2m14.7s/4m20.0s

running (2m15.9s), 278/500 VUs, 1029224 complete and 0 interrupted iterations
default   [  52% ] 278/500 VUs  2m15.7s/4m20.0s

running (2m16.9s), 283/500 VUs, 1038061 complete and 0 interrupted iterations
default   [  53% ] 283/500 VUs  2m16.7s/4m20.0s

running (2m17.9s), 288/500 VUs, 1047076 complete and 0 interrupted iterations
default   [  53% ] 288/500 VUs  2m17.7s/4m20.0s

running (2m18.9s), 293/500 VUs, 1055911 complete and 0 interrupted iterations
default   [  53% ] 293/500 VUs  2m18.7s/4m20.0s

running (2m19.9s), 298/500 VUs, 1064675 complete and 0 interrupted iterations
default   [  54% ] 298/500 VUs  2m19.7s/4m20.0s

running (2m20.9s), 300/500 VUs, 1072840 complete and 0 interrupted iterations
default   [  54% ] 300/500 VUs  2m20.7s/4m20.0s

running (2m21.9s), 300/500 VUs, 1081827 complete and 0 interrupted iterations
default   [  55% ] 300/500 VUs  2m21.7s/4m20.0s

running (2m22.9s), 300/500 VUs, 1091007 complete and 0 interrupted iterations
default   [  55% ] 300/500 VUs  2m22.7s/4m20.0s

running (2m23.9s), 300/500 VUs, 1100032 complete and 0 interrupted iterations
default   [  55% ] 300/500 VUs  2m23.7s/4m20.0s

running (2m24.9s), 300/500 VUs, 1109082 complete and 0 interrupted iterations
default   [  56% ] 300/500 VUs  2m24.7s/4m20.0s

running (2m25.9s), 300/500 VUs, 1117792 complete and 0 interrupted iterations
default   [  56% ] 300/500 VUs  2m25.7s/4m20.0s

running (2m26.9s), 300/500 VUs, 1126659 complete and 0 interrupted iterations
default   [  56% ] 300/500 VUs  2m26.7s/4m20.0s

running (2m27.9s), 300/500 VUs, 1135683 complete and 0 interrupted iterations
default   [  57% ] 300/500 VUs  2m27.7s/4m20.0s

running (2m28.9s), 300/500 VUs, 1144530 complete and 0 interrupted iterations
default   [  57% ] 300/500 VUs  2m28.7s/4m20.0s

running (2m29.9s), 300/500 VUs, 1153548 complete and 0 interrupted iterations
default   [  58% ] 300/500 VUs  2m29.7s/4m20.0s

running (2m30.9s), 300/500 VUs, 1161925 complete and 0 interrupted iterations
default   [  58% ] 300/500 VUs  2m30.7s/4m20.0s

running (2m31.9s), 300/500 VUs, 1170606 complete and 0 interrupted iterations
default   [  58% ] 300/500 VUs  2m31.7s/4m20.0s

running (2m32.9s), 300/500 VUs, 1179248 complete and 0 interrupted iterations
default   [  59% ] 300/500 VUs  2m32.7s/4m20.0s

running (2m33.9s), 300/500 VUs, 1187613 complete and 0 interrupted iterations
default   [  59% ] 300/500 VUs  2m33.7s/4m20.0s

running (2m34.9s), 300/500 VUs, 1196259 complete and 0 interrupted iterations
default   [  60% ] 300/500 VUs  2m34.7s/4m20.0s

running (2m35.9s), 300/500 VUs, 1204513 complete and 0 interrupted iterations
default   [  60% ] 300/500 VUs  2m35.7s/4m20.0s

running (2m36.9s), 300/500 VUs, 1213518 complete and 0 interrupted iterations
default   [  60% ] 300/500 VUs  2m36.7s/4m20.0s

running (2m37.9s), 300/500 VUs, 1222623 complete and 0 interrupted iterations
default   [  61% ] 300/500 VUs  2m37.7s/4m20.0s

running (2m38.9s), 300/500 VUs, 1231274 complete and 0 interrupted iterations
default   [  61% ] 300/500 VUs  2m38.7s/4m20.0s

running (2m39.9s), 300/500 VUs, 1240183 complete and 0 interrupted iterations
default   [  61% ] 300/500 VUs  2m39.7s/4m20.0s

running (2m40.9s), 300/500 VUs, 1248451 complete and 0 interrupted iterations
default   [  62% ] 300/500 VUs  2m40.7s/4m20.0s

running (2m41.9s), 300/500 VUs, 1257617 complete and 0 interrupted iterations
default   [  62% ] 300/500 VUs  2m41.7s/4m20.0s

running (2m42.9s), 300/500 VUs, 1266747 complete and 0 interrupted iterations
default   [  63% ] 300/500 VUs  2m42.7s/4m20.0s

running (2m43.9s), 300/500 VUs, 1275559 complete and 0 interrupted iterations
default   [  63% ] 300/500 VUs  2m43.7s/4m20.0s

running (2m44.9s), 300/500 VUs, 1284542 complete and 0 interrupted iterations
default   [  63% ] 300/500 VUs  2m44.7s/4m20.0s

running (2m45.9s), 300/500 VUs, 1292854 complete and 0 interrupted iterations
default   [  64% ] 300/500 VUs  2m45.7s/4m20.0s

running (2m46.9s), 300/500 VUs, 1301606 complete and 0 interrupted iterations
default   [  64% ] 300/500 VUs  2m46.7s/4m20.0s

running (2m47.9s), 300/500 VUs, 1310562 complete and 0 interrupted iterations
default   [  65% ] 300/500 VUs  2m47.7s/4m20.0s

running (2m48.9s), 300/500 VUs, 1319508 complete and 0 interrupted iterations
default   [  65% ] 300/500 VUs  2m48.7s/4m20.0s

running (2m49.9s), 300/500 VUs, 1327885 complete and 0 interrupted iterations
default   [  65% ] 300/500 VUs  2m49.7s/4m20.0s

running (2m50.9s), 300/500 VUs, 1336490 complete and 0 interrupted iterations
default   [  66% ] 300/500 VUs  2m50.7s/4m20.0s

running (2m51.9s), 300/500 VUs, 1345635 complete and 0 interrupted iterations
default   [  66% ] 300/500 VUs  2m51.7s/4m20.0s

running (2m52.9s), 300/500 VUs, 1354586 complete and 0 interrupted iterations
default   [  66% ] 300/500 VUs  2m52.7s/4m20.0s

running (2m53.9s), 300/500 VUs, 1363385 complete and 0 interrupted iterations
default   [  67% ] 300/500 VUs  2m53.7s/4m20.0s

running (2m54.9s), 300/500 VUs, 1372280 complete and 0 interrupted iterations
default   [  67% ] 300/500 VUs  2m54.7s/4m20.0s

running (2m55.9s), 300/500 VUs, 1380761 complete and 0 interrupted iterations
default   [  68% ] 300/500 VUs  2m55.7s/4m20.0s

running (2m56.9s), 300/500 VUs, 1389935 complete and 0 interrupted iterations
default   [  68% ] 300/500 VUs  2m56.7s/4m20.0s

running (2m57.9s), 300/500 VUs, 1398894 complete and 0 interrupted iterations
default   [  68% ] 300/500 VUs  2m57.7s/4m20.0s

running (2m58.9s), 300/500 VUs, 1407853 complete and 0 interrupted iterations
default   [  69% ] 300/500 VUs  2m58.7s/4m20.0s

running (2m59.9s), 300/500 VUs, 1416554 complete and 0 interrupted iterations
default   [  69% ] 300/500 VUs  2m59.7s/4m20.0s

running (3m00.9s), 307/500 VUs, 1425215 complete and 0 interrupted iterations
default   [  70% ] 307/500 VUs  3m00.7s/4m20.0s

running (3m01.9s), 317/500 VUs, 1434428 complete and 0 interrupted iterations
default   [  70% ] 317/500 VUs  3m01.7s/4m20.0s

running (3m02.9s), 327/500 VUs, 1443579 complete and 0 interrupted iterations
default   [  70% ] 327/500 VUs  3m02.7s/4m20.0s

running (3m03.9s), 337/500 VUs, 1452506 complete and 0 interrupted iterations
default   [  71% ] 337/500 VUs  3m03.7s/4m20.0s

running (3m04.9s), 347/500 VUs, 1461443 complete and 0 interrupted iterations
default   [  71% ] 347/500 VUs  3m04.7s/4m20.0s

running (3m05.9s), 357/500 VUs, 1469963 complete and 0 interrupted iterations
default   [  71% ] 357/500 VUs  3m05.7s/4m20.0s

running (3m06.9s), 367/500 VUs, 1479147 complete and 0 interrupted iterations
default   [  72% ] 367/500 VUs  3m06.7s/4m20.0s

running (3m07.9s), 377/500 VUs, 1487857 complete and 0 interrupted iterations
default   [  72% ] 377/500 VUs  3m07.7s/4m20.0s

running (3m08.9s), 387/500 VUs, 1496985 complete and 0 interrupted iterations
default   [  73% ] 387/500 VUs  3m08.7s/4m20.0s

running (3m09.9s), 397/500 VUs, 1505758 complete and 0 interrupted iterations
default   [  73% ] 397/500 VUs  3m09.7s/4m20.0s

running (3m10.9s), 407/500 VUs, 1513931 complete and 0 interrupted iterations
default   [  73% ] 407/500 VUs  3m10.7s/4m20.0s

running (3m11.9s), 416/500 VUs, 1522967 complete and 0 interrupted iterations
default   [  74% ] 416/500 VUs  3m11.7s/4m20.0s

running (3m12.9s), 427/500 VUs, 1532169 complete and 0 interrupted iterations
default   [  74% ] 427/500 VUs  3m12.7s/4m20.0s

running (3m13.9s), 437/500 VUs, 1541234 complete and 0 interrupted iterations
default   [  75% ] 437/500 VUs  3m13.7s/4m20.0s

running (3m14.9s), 447/500 VUs, 1550186 complete and 0 interrupted iterations
default   [  75% ] 447/500 VUs  3m14.7s/4m20.0s

running (3m15.9s), 457/500 VUs, 1558683 complete and 0 interrupted iterations
default   [  75% ] 457/500 VUs  3m15.8s/4m20.0s

running (3m16.9s), 467/500 VUs, 1567558 complete and 0 interrupted iterations
default   [  76% ] 467/500 VUs  3m16.7s/4m20.0s

running (3m17.9s), 477/500 VUs, 1576248 complete and 0 interrupted iterations
default   [  76% ] 477/500 VUs  3m17.7s/4m20.0s

running (3m18.9s), 487/500 VUs, 1585337 complete and 0 interrupted iterations
default   [  76% ] 487/500 VUs  3m18.7s/4m20.0s

running (3m19.9s), 497/500 VUs, 1593788 complete and 0 interrupted iterations
default   [  77% ] 497/500 VUs  3m19.7s/4m20.0s

running (3m20.9s), 500/500 VUs, 1601791 complete and 0 interrupted iterations
default   [  77% ] 500/500 VUs  3m20.7s/4m20.0s

running (3m21.9s), 500/500 VUs, 1610678 complete and 0 interrupted iterations
default   [  78% ] 500/500 VUs  3m21.7s/4m20.0s

running (3m22.9s), 500/500 VUs, 1619609 complete and 0 interrupted iterations
default   [  78% ] 500/500 VUs  3m22.7s/4m20.0s

running (3m23.9s), 500/500 VUs, 1628556 complete and 0 interrupted iterations
default   [  78% ] 500/500 VUs  3m23.7s/4m20.0s

running (3m24.9s), 500/500 VUs, 1637294 complete and 0 interrupted iterations
default   [  79% ] 500/500 VUs  3m24.7s/4m20.0s

running (3m25.9s), 500/500 VUs, 1645664 complete and 0 interrupted iterations
default   [  79% ] 500/500 VUs  3m25.7s/4m20.0s

running (3m26.9s), 500/500 VUs, 1654410 complete and 0 interrupted iterations
default   [  80% ] 500/500 VUs  3m26.7s/4m20.0s

running (3m27.9s), 500/500 VUs, 1663268 complete and 0 interrupted iterations
default   [  80% ] 500/500 VUs  3m27.7s/4m20.0s

running (3m28.9s), 500/500 VUs, 1672378 complete and 0 interrupted iterations
default   [  80% ] 500/500 VUs  3m28.7s/4m20.0s

running (3m29.9s), 500/500 VUs, 1681059 complete and 0 interrupted iterations
default   [  81% ] 500/500 VUs  3m29.7s/4m20.0s

running (3m30.9s), 500/500 VUs, 1689584 complete and 0 interrupted iterations
default   [  81% ] 500/500 VUs  3m30.7s/4m20.0s

running (3m31.9s), 500/500 VUs, 1698352 complete and 0 interrupted iterations
default   [  81% ] 500/500 VUs  3m31.7s/4m20.0s

running (3m32.9s), 500/500 VUs, 1707376 complete and 0 interrupted iterations
default   [  82% ] 500/500 VUs  3m32.7s/4m20.0s

running (3m33.9s), 500/500 VUs, 1716383 complete and 0 interrupted iterations
default   [  82% ] 500/500 VUs  3m33.7s/4m20.0s

running (3m34.9s), 500/500 VUs, 1725410 complete and 0 interrupted iterations
default   [  83% ] 500/500 VUs  3m34.7s/4m20.0s

running (3m35.9s), 500/500 VUs, 1733747 complete and 0 interrupted iterations
default   [  83% ] 500/500 VUs  3m35.7s/4m20.0s

running (3m36.9s), 500/500 VUs, 1742305 complete and 0 interrupted iterations
default   [  83% ] 500/500 VUs  3m36.7s/4m20.0s

running (3m37.9s), 500/500 VUs, 1751256 complete and 0 interrupted iterations
default   [  84% ] 500/500 VUs  3m37.7s/4m20.0s

running (3m38.9s), 500/500 VUs, 1759977 complete and 0 interrupted iterations
default   [  84% ] 500/500 VUs  3m38.7s/4m20.0s

running (3m39.9s), 500/500 VUs, 1768891 complete and 0 interrupted iterations
default   [  85% ] 500/500 VUs  3m39.7s/4m20.0s

running (3m40.9s), 500/500 VUs, 1777390 complete and 0 interrupted iterations
default   [  85% ] 500/500 VUs  3m40.7s/4m20.0s

running (3m41.9s), 500/500 VUs, 1786574 complete and 0 interrupted iterations
default   [  85% ] 500/500 VUs  3m41.7s/4m20.0s

running (3m42.9s), 500/500 VUs, 1795720 complete and 0 interrupted iterations
default   [  86% ] 500/500 VUs  3m42.7s/4m20.0s

running (3m43.9s), 500/500 VUs, 1804727 complete and 0 interrupted iterations
default   [  86% ] 500/500 VUs  3m43.7s/4m20.0s

running (3m44.9s), 500/500 VUs, 1813817 complete and 0 interrupted iterations
default   [  86% ] 500/500 VUs  3m44.7s/4m20.0s

running (3m45.9s), 500/500 VUs, 1821982 complete and 0 interrupted iterations
default   [  87% ] 500/500 VUs  3m45.7s/4m20.0s

running (3m46.9s), 500/500 VUs, 1831023 complete and 0 interrupted iterations
default   [  87% ] 500/500 VUs  3m46.7s/4m20.0s

running (3m47.9s), 500/500 VUs, 1839818 complete and 0 interrupted iterations
default   [  88% ] 500/500 VUs  3m47.7s/4m20.0s

running (3m48.9s), 500/500 VUs, 1848611 complete and 0 interrupted iterations
default   [  88% ] 500/500 VUs  3m48.7s/4m20.0s

running (3m49.9s), 500/500 VUs, 1857694 complete and 0 interrupted iterations
default   [  88% ] 500/500 VUs  3m49.7s/4m20.0s

running (3m50.9s), 500/500 VUs, 1865996 complete and 0 interrupted iterations
default   [  89% ] 500/500 VUs  3m50.7s/4m20.0s

running (3m51.9s), 500/500 VUs, 1875218 complete and 0 interrupted iterations
default   [  89% ] 500/500 VUs  3m51.7s/4m20.0s

running (3m52.9s), 500/500 VUs, 1884218 complete and 0 interrupted iterations
default   [  90% ] 500/500 VUs  3m52.7s/4m20.0s

running (3m53.9s), 500/500 VUs, 1893273 complete and 0 interrupted iterations
default   [  90% ] 500/500 VUs  3m53.7s/4m20.0s

running (3m54.9s), 500/500 VUs, 1902272 complete and 0 interrupted iterations
default   [  90% ] 500/500 VUs  3m54.7s/4m20.0s

running (3m55.9s), 500/500 VUs, 1910577 complete and 0 interrupted iterations
default   [  91% ] 500/500 VUs  3m55.7s/4m20.0s

running (3m56.9s), 500/500 VUs, 1919700 complete and 0 interrupted iterations
default   [  91% ] 500/500 VUs  3m56.7s/4m20.0s

running (3m57.9s), 500/500 VUs, 1928799 complete and 0 interrupted iterations
default   [  91% ] 500/500 VUs  3m57.7s/4m20.0s

running (3m58.9s), 500/500 VUs, 1937707 complete and 0 interrupted iterations
default   [  92% ] 500/500 VUs  3m58.7s/4m20.0s

running (3m59.9s), 500/500 VUs, 1946523 complete and 0 interrupted iterations
default   [  92% ] 500/500 VUs  3m59.7s/4m20.0s

running (4m00.9s), 483/500 VUs, 1954718 complete and 0 interrupted iterations
default   [  93% ] 483/500 VUs  4m00.7s/4m20.0s

running (4m01.9s), 458/500 VUs, 1964009 complete and 0 interrupted iterations
default   [  93% ] 458/500 VUs  4m01.7s/4m20.0s

running (4m02.9s), 433/500 VUs, 1973323 complete and 0 interrupted iterations
default   [  93% ] 433/500 VUs  4m02.7s/4m20.0s

running (4m03.9s), 408/500 VUs, 1982487 complete and 0 interrupted iterations
default   [  94% ] 408/500 VUs  4m03.7s/4m20.0s

running (4m04.9s), 382/500 VUs, 1991390 complete and 0 interrupted iterations
default   [  94% ] 382/500 VUs  4m04.7s/4m20.0s

running (4m05.9s), 359/500 VUs, 1999957 complete and 0 interrupted iterations
default   [  95% ] 359/500 VUs  4m05.7s/4m20.0s

running (4m06.9s), 333/500 VUs, 2008898 complete and 0 interrupted iterations
default   [  95% ] 333/500 VUs  4m06.7s/4m20.0s

running (4m07.9s), 308/500 VUs, 2018169 complete and 0 interrupted iterations
default   [  95% ] 308/500 VUs  4m07.7s/4m20.0s

running (4m08.9s), 283/500 VUs, 2026459 complete and 0 interrupted iterations
default   [  96% ] 283/500 VUs  4m08.7s/4m20.0s

running (4m09.9s), 258/500 VUs, 2034930 complete and 0 interrupted iterations
default   [  96% ] 258/500 VUs  4m09.7s/4m20.0s

running (4m10.9s), 233/500 VUs, 2043243 complete and 0 interrupted iterations
default   [  96% ] 233/500 VUs  4m10.7s/4m20.0s

running (4m11.9s), 208/500 VUs, 2052517 complete and 0 interrupted iterations
default   [  97% ] 208/500 VUs  4m11.7s/4m20.0s

running (4m12.9s), 183/500 VUs, 2061568 complete and 0 interrupted iterations
default   [  97% ] 183/500 VUs  4m12.7s/4m20.0s

running (4m13.9s), 157/500 VUs, 2069935 complete and 0 interrupted iterations
default   [  98% ] 157/500 VUs  4m13.7s/4m20.0s

running (4m14.9s), 133/500 VUs, 2078948 complete and 0 interrupted iterations
default   [  98% ] 133/500 VUs  4m14.7s/4m20.0s

running (4m15.9s), 108/500 VUs, 2087082 complete and 0 interrupted iterations
default   [  98% ] 108/500 VUs  4m15.7s/4m20.0s

running (4m16.9s), 083/500 VUs, 2096062 complete and 0 interrupted iterations
default   [  99% ] 083/500 VUs  4m16.7s/4m20.0s

running (4m17.9s), 057/500 VUs, 2104997 complete and 0 interrupted iterations
default   [  99% ] 057/500 VUs  4m17.7s/4m20.0s

running (4m18.9s), 032/500 VUs, 2113933 complete and 0 interrupted iterations
default   [ 100% ] 032/500 VUs  4m18.7s/4m20.0s

running (4m19.9s), 007/500 VUs, 2122467 complete and 0 interrupted iterations
default   [ 100% ] 007/500 VUs  4m19.7s/4m20.0s

running (4m20.2s), 000/500 VUs, 2123358 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/500 VUs  4m20s


  █ THRESHOLDS 

    checks{endpoint:redirect}
    ✓ 'rate>0.90' rate=100.00%

    http_req_failed{endpoint:redirect}
    ✓ 'rate<0.10' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 6370076 24480.026793/s
    checks_succeeded...: 100.00% 6370076 out of 6370076
    checks_failed......: 0.00%   0 out of 6370076

    ✓ 단축 URL 생성 상태는 201이다
    ✓ shortCode가 반환된다
    ✓ 리다이렉트 상태는 302이다
    ✓ Location 헤더가 존재한다
    ✓ 원본 URL이 올바르다

    HTTP
    http_req_duration..............: avg=30.87ms min=449.87µs med=22.04ms max=389.7ms  p(90)=73.64ms p(95)=90.98ms
      { expected_response:true }...: avg=30.87ms min=449.87µs med=22.04ms max=389.7ms  p(90)=73.64ms p(95)=90.98ms
    http_req_failed................: 0.00%   0 out of 2123360
      { endpoint:redirect }........: 0.00%   0 out of 2123358
    http_reqs......................: 2123360 8160.014055/s

    EXECUTION
    iteration_duration.............: avg=31.06ms min=517.16µs med=22.24ms max=391.27ms p(90)=73.81ms p(95)=91.23ms
    iterations.....................: 2123358 8160.006369/s
    vus............................: 7       min=4            max=500
    vus_max........................: 500     min=500          max=500

    NETWORK
    data_received..................: 228 MB  875 kB/s
    data_sent......................: 153 MB  588 kB/s



running (4m20.2s), 000/500 VUs, 2123358 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/500 VUs  4m20s